#!/usr/bin/python
# -*- coding: utf-8 -*-
#####################################################################
###       РАНДОМАЙЗЕР ВАРИАНТОВ ЗАДАНИЙ НА ЭКЗАМЕН ПО ОСИС        ###
#####################################################################
# ВЕРСИЯ от 25.10.24

# Импорт необходимых библиотек
import random as rm
import csv
# создаем список фио из файла
fio_list = []
# читаем csv файл fiogroups.csv со списком ФИО и создаем список
with open("fiogroups.csv", encoding='utf-8') as r_file:
    # Создаем объект reader, указываем символ-разделитель как новая строка","
    file_reader = csv.reader(r_file, delimiter = "\n")
    # Считывание данных из CSV файла и осуществляем добавление в массив
    for row in file_reader:
      fio_list.extend(row)

'''
КИБ-22
Заломов Байканур Семенович
Злыков Мухандр Сергеевич
'''
# создаем пустую переменную str
totalinfo = ''
# Объявляем список групп, для сверки по студентам
# groupscheck = ['КИСП-9-21(1)', 'КИСП-9-21(2)', 'КИСП-9-21(3)', 'КИБ-22', 'КИСП-22(1)', 'КИСП-22(2)', 'КИСП-22(3)']

groupscheck = ['КИБ-9-22', 'КИБ-23', 'КИСП-23 (1)', 'КИСП-23 (2)', 'КИСП-9-22(1)', 'КИСП-9-22(2)']
# Объявляем переменную, со списков количества экз.вопросов.
randomarray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

for i in range(1):
    for student in fio_list:
        if student in groupscheck:
            print("\n==============================================================")
            totalinfo += "\n==============================================================\n"
            print("Группа:",student)
            totalinfo += "Группа: "+student+"\n"
            print("==============================================================\n")
            totalinfo += "==============================================================\n"
        else:
            # print(len(randomarray))
            varrandom = rm.choice(randomarray)
            randomarray.remove(varrandom)
            # Если наш массив достиг нуля, то добовляем в еего снова 20 элементов
            if (len(randomarray) == 0):
                randomarray = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
            print("Студент: ", student, "- Номер варианта:", varrandom)
            listreduce = f"Студент:  {student} - Номер варианта: {varrandom}"
            # добавляем в переменную totalinfo каждый вывод конкотинации цикла (listreduce) с новой строки
            totalinfo += (str(listreduce)) + "\n"

print("\nСтудент счастлифчик: ", rm.choice(fio_list))
totalinfo += "\nСтудент счастлифчик: " + str(rm.choice(fio_list))

# создаем файл variantsresponse.txt
f = open('variantsresponse.txt','a+')
# пишем в него вывод переменной totalinfo и закрываем работу с файлом
f.write(totalinfo)
f.write("\n================================================================\n\n")
f.close()
